import * as React from "react";
import type { IconProps } from "./types";

// ── 图影音-扬声器-中声 ──────────────────────────────────────
// 来源：icon/图影音-扬声器-中声.svg
export const 图影音扬声器中声 = React.forwardRef<SVGSVGElement, IconProps>(
  function 图影音扬声器中声({ size = 48, className, style, ...props }, ref) {
    const uid = React.useId();
    return (
      <svg
        width={size}
        height={size}
        viewBox="0 0 48 48"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
        className={className}
        style={style}
        ref={ref}
        {...props}
      >
        <mask
          id={`mask0_31_6594-${uid}`}
          style={{ maskType: "alpha" } as React.CSSProperties}
          maskUnits="userSpaceOnUse"
          x="0"
          y="0"
          width="48"
          height="48"
        >
          <rect x="48" width="48" height="48" transform="rotate(90 48 0)" fill="#FF0606" />
        </mask>
        <g mask={`url(#mask0_31_6594-${uid})`}>
          <path
            fillRule="evenodd"
            clipRule="evenodd"
            d="M23.9346 5.59498C26.8127 2.91682 31.4999 4.95752 31.5 8.88893V39.1106C31.4996 43.0418 26.8126 45.0826 23.9346 42.4046L15.4395 34.4993H9C5.96243 34.4993 3.5 32.0368 3.5 28.9993V18.9993C3.50017 15.9619 5.96254 13.4993 9 13.4993H15.4395L23.9346 5.59498ZM28.5 8.88893C28.4999 7.57852 26.9379 6.89858 25.9785 7.79127L17.3389 15.8294C16.8762 16.2598 16.2677 16.4993 15.6357 16.4993H9C7.61939 16.4993 6.50017 17.6187 6.5 18.9993V28.9993C6.5 30.38 7.61929 31.4993 9 31.4993H15.6357C16.2676 31.4993 16.8763 31.7388 17.3389 32.1692L25.9785 40.2083C26.9378 41.1006 28.4996 40.4207 28.5 39.1106V8.88893ZM37.2002 17.5774C37.7918 16.9975 38.7414 17.0063 39.3213 17.5979C40.9374 19.2465 41.9365 21.5094 41.9365 24.0022C41.9364 26.4948 40.9373 28.757 39.3213 30.4055C38.7414 30.997 37.7918 31.0067 37.2002 30.427C36.6087 29.8472 36.599 28.8975 37.1787 28.3059C38.2673 27.1955 38.9364 25.6782 38.9365 24.0022C38.9365 22.3261 38.2673 20.809 37.1787 19.6985C36.5988 19.107 36.6087 18.1573 37.2002 17.5774Z"
            fill="currentColor"
          />
        </g>
      </svg>
    );
  }
);
图影音扬声器中声.displayName = "图影音扬声器中声";
