import * as React from "react";
import type { IconProps } from "./types";

// ── 图影音-扬声器-无声 ──────────────────────────────────────
// 来源：icon/图影音-扬声器-无声.svg
export const 图影音扬声器无声 = React.forwardRef<SVGSVGElement, IconProps>(
  function 图影音扬声器无声({ size = 48, className, style, ...props }, ref) {
    const uid = React.useId();
    return (
      <svg
        width={size}
        height={size}
        viewBox="0 0 48 48"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
        className={className}
        style={style}
        ref={ref}
        {...props}
      >
        <mask
          id={`mask0_31_6583-${uid}`}
          style={{ maskType: "alpha" } as React.CSSProperties}
          maskUnits="userSpaceOnUse"
          x="0"
          y="0"
          width="48"
          height="48"
        >
          <rect x="48" width="48" height="48" transform="rotate(90 48 0)" fill="#FF0606" />
        </mask>
        <g mask={`url(#mask0_31_6583-${uid})`}>
          <path
            fillRule="evenodd"
            clipRule="evenodd"
            d="M23.9346 5.59498C26.8127 2.91682 31.4999 4.95752 31.5 8.88893V39.1106C31.4996 43.0418 26.8126 45.0826 23.9346 42.4046L15.4395 34.4993H9C5.96243 34.4993 3.5 32.0368 3.5 28.9993V18.9993C3.50017 15.9619 5.96254 13.4993 9 13.4993H15.4395L23.9346 5.59498ZM28.5 8.88893C28.4999 7.57852 26.9379 6.89858 25.9785 7.79127L17.3389 15.8294C16.8762 16.2598 16.2677 16.4993 15.6357 16.4993H9C7.61939 16.4993 6.50017 17.6187 6.5 18.9993V28.9993C6.5 30.38 7.61929 31.4993 9 31.4993H15.6357C16.2676 31.4993 16.8763 31.7388 17.3389 32.1692L25.9785 40.2083C26.9378 41.1006 28.4996 40.4207 28.5 39.1106V8.88893ZM44.1338 18.3381C44.7195 17.7525 45.6691 17.7527 46.2549 18.3381C46.8406 18.9239 46.8406 19.8734 46.2549 20.4592L42.7178 23.9954L46.2529 27.5305C46.8387 28.1163 46.8385 29.0658 46.2529 29.6516C45.6671 30.2374 44.7176 30.2374 44.1318 29.6516L40.5967 26.1165L37.0625 29.6516C36.4767 30.2374 35.5272 30.2374 34.9414 29.6516C34.3559 29.0658 34.3557 28.1162 34.9414 27.5305L38.4756 23.9954L34.9395 20.4592C34.3538 19.8734 34.3537 18.9239 34.9395 18.3381C35.5252 17.7526 36.4748 17.7526 37.0605 18.3381L40.5967 21.8743L44.1338 18.3381Z"
            fill="currentColor"
          />
        </g>
      </svg>
    );
  }
);
图影音扬声器无声.displayName = "图影音扬声器无声";
