import * as React from "react";
import type { IconProps } from "./types";

// ── 用户头像-个人主页-填充 ────────────────────────────────────────
// 来源：icon/用户头像-个人主页-填充.svg
export const 用户头像个人主页填充 = React.forwardRef<SVGSVGElement, IconProps>(
  function 用户头像个人主页填充({ size = 48, className, style, ...props }, ref) {
    return (
      <svg
        width={size}
        height={size}
        viewBox="0 0 48 48"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
        className={className}
        style={style}
        ref={ref}
        {...props}
      >
        <path
          d="M27.2676 27C27.0974 27.2942 27 27.6357 27 28V43H10.5C8.29086 43 6.5 41.2091 6.5 39V36C6.5 31.0294 10.5294 27 15.5 27H27.2676ZM37 28C40.3137 28 43 30.6863 43 34V41C43 42.1046 42.1046 43 41 43H31C29.8954 43 29 42.1046 29 41V30C29 28.8954 29.8954 28 31 28H37ZM33.5 37C32.9477 37 32.5 37.4477 32.5 38C32.5 38.5523 32.9477 39 33.5 39H38.5C39.0523 39 39.5 38.5523 39.5 38C39.5 37.4477 39.0523 37 38.5 37H33.5ZM33.5 32C32.9477 32 32.5 32.4477 32.5 33C32.5 33.5523 32.9477 34 33.5 34H38.5C39.0523 34 39.5 33.5523 39.5 33C39.5 32.4477 39.0523 32 38.5 32H33.5ZM24 5C29.5228 5 34 9.47715 34 15C34 20.5228 29.5228 25 24 25C18.4772 25 14 20.5228 14 15C14 9.47715 18.4772 5 24 5Z"
          fill="currentColor"
        />
      </svg>
    );
  }
);
用户头像个人主页填充.displayName = "用户头像个人主页填充";
