import * as React from "react";
import type { IconProps } from "./types";

// ── 用户头像-虚拟背景-填充 ────────────────────────────────────────
// 来源：icon/用户头像-虚拟背景-填充.svg
export const 用户头像虚拟背景填充 = React.forwardRef<SVGSVGElement, IconProps>(
  function 用户头像虚拟背景填充({ size = 48, className, style, ...props }, ref) {
    return (
      <svg
        width={size}
        height={size}
        viewBox="0 0 48 48"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
        className={className}
        style={style}
        ref={ref}
        {...props}
      >
        <path
          d="M43 37C43 39.2091 41.2091 41 39 41H34.667C35.9554 40.9998 36.9998 39.9554 37 38.667V34.25C37 33.9357 36.9699 33.6282 36.917 33.3291L43 27.2471V37ZM15.1768 26.7852C15.3343 27.5683 15.5958 28.3136 15.9424 29.0088C13.1861 29.168 11 31.4538 11 34.25V38.0342L8.13086 40.9043C6.33973 40.5073 5 38.9106 5 37V36.9629L15.1768 26.7852ZM5 29.8916V22.8223L20.8223 7H27.8916L5 29.8916ZM43 20.1768L33.7725 29.4033C33.2394 29.1806 32.6617 29.0436 32.0566 29.0088C32.6586 27.8013 33 26.4409 33 25C33 24.4093 32.9407 23.8324 32.832 23.2734L43 13.1064V20.1768ZM39 7C39.8581 7 40.6523 7.27146 41.3037 7.73145L30.3809 18.6533C29.1503 17.4162 27.5626 16.5344 25.7852 16.1768L34.9629 7H39ZM5 15.751V11C5 8.79086 6.79086 7 9 7H13.751L5 15.751Z"
          fill="currentColor"
        />
        <path
          d="M30 25C30 28.3137 27.3137 31 24 31C20.6863 31 18 28.3137 18 25C18 21.6863 20.6863 19 24 19C27.3137 19 30 21.6863 30 25Z"
          fill="currentColor"
        />
        <path
          d="M14 37.25C14 34.3505 16.3505 32 19.25 32H28.75C31.6495 32 34 34.3505 34 37.25V38.6667C34 39.9553 32.9553 41 31.6667 41H16.3333C15.0447 41 14 39.9553 14 38.6667V37.25Z"
          fill="currentColor"
        />
      </svg>
    );
  }
);
用户头像虚拟背景填充.displayName = "用户头像虚拟背景填充";
