import * as React from "react";
import type { IconProps } from "./types";

// ── 用户头像-名片-填充 ────────────────────────────────────────────
// 来源：icon/用户头像-名片-填充.svg
export const 用户头像名片填充 = React.forwardRef<SVGSVGElement, IconProps>(
  function 用户头像名片填充({ size = 48, className, style, ...props }, ref) {
    return (
      <svg
        width={size}
        height={size}
        viewBox="0 0 48 48"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
        className={className}
        style={style}
        ref={ref}
        {...props}
      >
        <path
          d="M40 7C42.2091 7.00001 44 8.79087 44 11V37C44 39.2091 42.2091 41 40 41H8.01465C5.80627 41 4.01573 39.2103 4.01465 37.002L4.00195 11.002C4.00088 8.79205 5.79205 7 8.00195 7H40ZM15.667 26C13.6419 26 12 27.6419 12 29.667V32.625C12 33.3844 12.6156 34 13.375 34H26.625C27.3844 34 28 33.3844 28 32.625V29.667C28 27.6419 26.3581 26 24.333 26H15.667ZM31.5 23C30.6716 23 30 23.6716 30 24.5C30 25.3284 30.6716 26 31.5 26H34.5C35.3284 26 36 25.3284 36 24.5C36 23.6716 35.3284 23 34.5 23H31.5ZM20 14C17.2386 14 15 16.2386 15 19C15 21.7614 17.2386 24 20 24C22.7614 24 25 21.7614 25 19C25 16.2386 22.7614 14 20 14ZM29.5 18C28.6716 18 28 18.6716 28 19.5C28 20.3284 28.6716 21 29.5 21H34.5C35.3284 21 36 20.3284 36 19.5C36 18.6716 35.3284 18 34.5 18H29.5Z"
          fill="currentColor"
        />
      </svg>
    );
  }
);
用户头像名片填充.displayName = "用户头像名片填充";
