import * as React from "react";
import type { IconProps } from "./types";

// ── 通用工具-编辑 ────────────
export const 通用工具编辑 = React.forwardRef<SVGSVGElement, IconProps>(
  function 通用工具编辑({ size = 48, className, style, ...props }, ref) {
    return (
      <svg
        width={size}
        height={size}
        viewBox="0 0 48 48"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
        className={className}
        style={style}
        ref={ref}
        {...props}
      >
        <path d="M6.5 12.4999C6.5 9.46233 8.96243 6.99989 12 6.99989L24 6.99989C24.8284 6.99989 25.5 7.67147 25.5 8.4999C25.5 9.32833 24.8284 9.9999 24 9.9999L12 9.9999C10.6193 9.9999 9.5 11.1192 9.5 12.4999L9.5 35.5C9.5 36.8807 10.6193 38 12 38L36 38C37.3807 38 38.5 36.8807 38.5 35.5L38.5 23.4999C38.5 22.6715 39.1716 21.9999 40 21.9999C40.8284 21.9999 41.5 22.6715 41.5 23.4999L41.5 35.5C41.5 38.5376 39.0376 41 36 41L12 41C8.96244 41 6.5 38.5376 6.5 35.5L6.5 12.4999ZM21.9395 26.0605C21.3537 25.4747 21.3537 24.5252 21.9395 23.9394L38.9395 6.93934C39.5252 6.35356 40.4748 6.35356 41.0605 6.93934C41.6463 7.52513 41.6463 8.47466 41.0605 9.06044L24.0605 26.0605C23.4748 26.6463 22.5252 26.6463 21.9395 26.0605Z" fill="currentColor" />
      </svg>
    );
  }
);
通用工具编辑.displayName = "通用工具编辑";
