import * as React from "react";
import type { IconProps } from "./types";

// ── 通用工具-更多-带框 ────────────
export const 通用工具更多带框 = React.forwardRef<SVGSVGElement, IconProps>(
  function 通用工具更多带框({ size = 48, className, style, ...props }, ref) {
    return (
      <svg
        width={size}
        height={size}
        viewBox="0 0 48 48"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
        className={className}
        style={style}
        ref={ref}
        {...props}
      >
        <path d="M24 4.5C34.7696 4.5 43.5 13.2304 43.5 24C43.5 34.7696 34.7696 43.5 24 43.5C13.2304 43.5 4.5 34.7696 4.5 24C4.5 13.2304 13.2304 4.5 24 4.5ZM24 7.5C14.8873 7.5 7.5 14.8873 7.5 24C7.5 33.1127 14.8873 40.5 24 40.5C33.1127 40.5 40.5 33.1127 40.5 24C40.5 14.8873 33.1127 7.5 24 7.5ZM16 21.5C17.3807 21.5 18.5 22.6193 18.5 24C18.5 25.3807 17.3807 26.5 16 26.5C14.6193 26.5 13.5 25.3807 13.5 24C13.5 22.6193 14.6193 21.5 16 21.5ZM24 21.5C25.3807 21.5 26.5 22.6193 26.5 24C26.5 25.3807 25.3807 26.5 24 26.5C22.6193 26.5 21.5 25.3807 21.5 24C21.5 22.6193 22.6193 21.5 24 21.5ZM32 21.5C33.3807 21.5 34.5 22.6193 34.5 24C34.5 25.3807 33.3807 26.5 32 26.5C30.6193 26.5 29.5 25.3807 29.5 24C29.5 22.6193 30.6193 21.5 32 21.5Z" fill="currentColor" />
      </svg>
    );
  }
);
通用工具更多带框.displayName = "通用工具更多带框";
